package Loop.ForLoop;

public class For_Loop_Demo1 {
    /*  ++++++++++++++++++++++++ For loop ++++++++++++++++++++++++
        Syntax :
        +-----------------------------------------------------------+
        | for (Initialization ; Condition ; Increment/Decrement){   |
        |     Statement;                                            |
        | }                                                         |
        +-----------------------------------------------------------+
            o For loop มีคำสั่งอยู่ 4 ส่วน ได้แก่
            [1] Initialization : เป็นคำสั่งแรกที่จะทำงานก่อนโปรแกรมใน loop 
                                 ทำการการประกาศตัวแปรเพื่อใช้ใน loop เท่านั้น

            [2] Condition : เป็นคำสั่งเงื่อนไข ถ้าเงื่อนไขเป็นจริง ให้รันโปรแกรมใน loop

            [3] Increment/Decrement : เป็นคำสั่งการเพิ่ม/ลดค่าของตัวแปร จะถูกเรียกใช้เมื่อ
                                      ทำงานโปรแกรมใน loop ทั้งหมดเสร็จแล้ว           */
    public static void main(String[] args) {

        /* ประกาศ loop for โดย
         *  [1] Initialization : ประกาศตัวแปรจำนวนเต็ม i กำหนดให้ค่าเริ่มต้นเป็น 1
         *  [2] Condition : โปรแกรมใน loop จะทำงานก็ต่อเมื่อ "i จะต้องน้อยกว่า/เท่ากับ 10" 
         *  [3] Increment/Decrement : ค่า i จะเพิ่มขึ้นทีละ 1 ค่า เมื่อทำคำสั่งในลูปเสร็จแล้ว  */
        
        //*==================================================================
        for (int i = 1 ; i <= 10 ; i++){
            System.out.println("Number "+i);    
        }                                      
        //*==================================================================
        
        /*  ++++++++++++++ Compare with Python ++++++++++++++
            +-----------------------+
            | for i in range(1,11): |
            |    print("Number",i)  |
            +-----------------------+               
        */
    }
}
