package Loop.ForLoop;

public class For_Loop_Demo1 {
    /*  ++++++++++++++++++ For loop ++++++++++++++++++
        Systax :
        +-----------------------------------------------------------+
        | for (Initialization ; Condition ; Increment/Decrement){   |
        |     Statement;                                            |
        | }                                                         |
        +-----------------------------------------------------------+
            o For loop มีคำสั่งอยู่ 4 ส่วน ได้แก่
            [1] Initialization : เป็นคำสั่งการประกาศตัวแปรเพื่อใช้ในเฉพาะ loop ที่จะถูกเรียกใช้เมื่อ 
                loop เริ่มทำงาน
            [2] Condition : เป็นคำสั่งเงื่อนไขทำหน้าที่บอกลักษณะการวนรอบว่า loop จะวนกี่ครั้ง
            [3] Increment/Decrement : เป็นคำสั่งการเพิ่ม/ลดค่าของตัวแปร จะถูกเรียกใช้เมื่อ
                ทำคำสั่งใน loop ทั้งหมดเสร็จแล้ว
            [4] Statements : เป็นคำสั่งที่จะทำงานใน loop                                   */
    public static void main(String[] args) {

        /* ประกาศ loop for โดย
         *  [1] Initialization : ประกาศตัวแปรจำนวนเต็ม i กำหนดให้ค่าเริ่มต้นเป็น 1
         *  [2] Condition : i จะต้องน้อยกว่า/เท่ากับ 10 
         *  [3] Increment/Decrement : ค่า i จะเพิ่มขึ้นทีละ 1 เมื่อทำคำสั่งในลูปเสร็จแล้ว  */
        
        // ==================================================================
        for (int i = 1 ; i <= 10 ; i++){
            System.out.println("Number "+i);    // Print "Number i"
        }                                       // ปีกกาจบ loop for i
        // ==================================================================

        /*  ++++++++++++++ Compare with Python ++++++++++++++
            +-----------------------+
            | for i in range(1,11): |
            |    print("Number,"i)  |
            +-----------------------+               
        */
    }
}
